Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/care_in_your_community/occupational_therapy_services.html.txt.tmx
Source language: en
Languages: ga

source: Occupational therapy services are designed to help people who have a disability (physical, psychological or social) to achieve the maximum degree of independence in ordinary living
ga: Tá seirbhísí teiripe shaothair in ainm is cabhrú le daoine atá faoi mhíchumas (fisiceach, síceolaíochta nó sóisialta) chun an oiread neamhspleáchais agus is féidir a bhaint amach ina ngnáthshaol

source: Many occupational therapists work in Health Service Executive (HSE) Local Health Offices or Primary Care Teams
ga: Oibríonn go leor teiripeoirí saothair in Oifigí Sláinte Áitiúla nó i bhFoirne Cúraim Phríomhúil de chuid Fheidhmeannacht na Seirbhíse Sláinte (FSS)

source: In theory, everyone who needs the service of an occupational therapist is eligible
ga: I dtaobh na teoirice de, tá gach duine a dteastaíonn seirbhís teiripeoir saothair uathu incháilithe

source: In practice, there may be long waiting lists and applications are prioritised according to need
ga: I gcleachtas, d’fhéadfadh liostaí fada feithimh a bheith ann agus tugtar tús áite d’iarratais de réir riachtanais

source: Prescribed aids and appliances are available free of charge to medical card holders, people on the Long Term Illness Scheme and people who have a Health Amendment Act Card
ga: Tá áiseanna agus fearais ordaithe ar fáil saor in aisce do shealbhóirí cárta leighis, daoine atá rannpháirteach sa Scéim Breoiteachta Fadtéarmaí agus daoine a bhfuil Cárta faoin Acht Sláinte (Leasú) acu

source: The Association of Occupational Therapists of Ireland has a database of occupational therapists in private practice
ga: Tá bunachar sonraí de theiripeoirí saothair i gcleachtas príobháideach ag Cumann Teiripeoirí Saothair na hÉireann (an comhlacht gairmiúil a rialaíonn an ghairm in Éirinn)

source: CORU, the regulator for health and social care professionals, has a statutory register of occupational therapists in both the public and private sector
ga: Tá clár reachtúil de theiripeoirí saothair san earnáil phoiblí agus phríobháideach araon ag CORU, an rialtóir um ghairmithe sláinte agus cúraim shóisialaigh

source: Usually, the occupational therapist carries out an assessment of your ability to function in relation to the normal requirements of living – dressing, eating, bathing, etc
ga: De ghnáth, tugann an teiripeoir saothair faoi mheasúnú ar do chumas chun feidhmiú maidir le gnáthriachtanais mhaireachtála – gléasadh, ithe, folcadh, etc

source: Your home arrangements are also assessed and a decision is made as to what assistance you need by way of aids and appliances
ga: Anuas air sin, déantar measúnú ar na socruithe atá leagtha amach i do theach cónaithe agus déantar cinneadh cén cúnamh a theastaíonn uait i dtaobh áiseanna agus fearas

source: For example, a wheelchair, chair lift or downstairs bathroom
ga: Mar shampla, cathaoir rothaí, ardaitheoir cathaoireach nó seomra folctha thíos staighre

source: The occupational therapist may then arrange for the provision of some appropriate aids and appliances by the HSE if you are eligible or may certify that you are eligible for the housing adaptation grant for people with a disability
ga: D’fhéadfadh an teiripeoir saothair socruithe a dhéanamh, ansin, go soláthróidh FSS áiseanna agus fearais oiriúnacha má tá tú incháilithe nó féadfaidh siad a dheimhniú go bhfuil tú incháilithe don deontas oiriúnaithe tithe do dhaoine atá faoi mhíchumas

source: They may also provide advice and assistance to you and your family or carers in relation to changes or adaptations that need to be made
ga: Anuas air sin, d’fhéadfaidís comhairle agus cúnamh a sholáthar duit agus do do theaghlach nó cúramóirí maidir le hathruithe nach mór a dhéanamh

source: You may apply directly to your Local Health Office for the services of an occupational therapist, but it is more usual for you to be referred by a public health nurse, family doctor (GP) or hospital
ga: Féadfaidh tú iarratas a dhéanamh go díreach le d’Oifig Sláinte Áitiúil ar sheirbhísí teiripeoir saothair, ach is gnáiche go ndéanfaidh altra sláinte poiblí, dochtúir teaghlaigh (LG) nó ospidéal thú a atreorú

source: To find a private occupational therapist contact the Association of Occupational Therapists of Ireland or consult the database on its website
ga: Chun teacht ar theiripeoir saothair príobháideach, déan teagmháil le Cumann Teiripeoirí Saothair na hÉireann nó caith súil ar an mbunachar sonraí ar a láithreán gréasáin
